/*დავალებაში სადაც წერია რომ ფუნქციამ უნდა დააბრუნოს მნიშვნელობა - ფუნქციის მიერ დაბრუნებული მნიშვნელობა/შედეგი/result უნდა დაიბეჭდოს ფუნქციის გარეთ 
დავალებაში რომელშიც წერია რომ ფუნქციამ უნდა
დაბეჭდოს result ნიშნავს რომ ფუნქციას არ აქვს return და ფუნქციაშივე უნდა დაიბეჭდოს შედეგი.


1. დაწერეთ ფუნქცია რომელსაც გადასცემ ორ რიცხვს (m,n) და დააბრუნებს რომელიც მეტია იმ რიცხვს , თუ რიცხვები ტოლია დააბრუნებს 0 -ს
2. დაწერეთ ფუნქცია რომელსაც გადასცემთ ორ ცვლადს(რიცხვს), დააბრუნეთ რიცხვების ჯამი
3. დაწერეთ ფუნქცია რომელიც დააბეჭდავს თქვენ სახელს და გვარს ( ფუნქციას არ აქვს პარამეტრი)
4. დაწერეთ ფუნქცია ორი პარამეტრით : firstname და lastname დააბრუნეთ სრული სახელი და დაბეჭდეთ ( ფუნქცია აბრუნებს სრულ სახელს და ფუნქციის გარეთ ბეჭდავთ)
5. Დაწერეთ ფუნქცია რომელსაც გადასცემთ ერთ რიცხვს (n) და ფუნქციამ უნდა დააბრუნოს 1 დან ამ რიცხვამდე  (n-მდე) რიცხვების ნამრავლი ( ანუ თუ რიცხვი არის 3 ფუნქციამ უნდა დააბრუნოს 1*2*3 -ის მნიშვნელობა, 
დაგჭირდებათ ახალი ცვლადის გამოცხადება ფუნქციის შიგნით რომელსაც მიანიჭებთ ნამრავლის მნიშვნელობას. Პ.ს. გამოიყენეთ თქვენთვის სასურველი ციკლი)

Შემდეგი დავალებებისთვის გამოიყენეთ :ობიექტი student - რომელსაც აქვს შემდეგი properties: firstName, lastName, age, scores (scores არის შემდეგი რიცხვების
 მასივი: 4,7,5,3,2) და მეთოდი fullName რომელიც 
აბრუნებს სტუდენტის სრულ სახელს ( ობიექტი შეიცავს მეთოდს, ცალკე ფუნქციად არ უნდა დაწეროთ ) 

6. დაბეჭდეთ  სტუდენტის სრული სახელი და ასაკი (სახელი+გვარი+ასაკი  გამოიყენეთ student ობიექტის მეთოდი)
7. Დაწერეთ ფუნქცია რომელსაც გადასცემთ სტუდენტის ქულებს ( scores) და ფუნქცია დააბრუნებს  ქულების ჯამს
8. დაბეჭდეთ სტუდენტის სახელი და ასაკი ცალცალკე(ფუნქციისა და მეთოდის გარეშე)*/

/*function numbers (m , n ) 
{
    if (m>n) {return m } ;
 if (n>m) {return n} ;
  if (m=n) {return 0} 
}
console.log (numbers(8,24))*/


/*function twonumber(m,n) {return (m+n)}
console.log (twonumber(8,24))*/

/*function id() {console.log ("Luka solo")}
id()*/

/*function fullName(firstName , lastName) {return firstName + " " + lastName }
console.log(fullName("luka","solo"))*/

 /*function x(n)
  {let m=1 ;
     for ( let i=1 ; i<=n ; i++ )
         {m*=i  } 
     {return m} 
     } 
     console.log(x(8)*/


let student ={
    firstName:"luka" ,
    lastName:"solo" ,
     age:26 ,
     marks:[4,7,5,3,2] ,
fullname(){console.log (this.firstName+" "+this.lastName) } 
fullinfo(){this.firstName+" "+this.lastName+" " +this.age }
}
student.fullname()
student.fullinfo()



function grade(marks) {
    let a = 0;

    for (let i = 0; i < marks.length; i++) {
        a += scores[i];
    }

    return a
}

console.log(grade( student.marks))







console.log(student.firstName+" "+student.age)
